# Directory to install application casks
cask_args appdir: '/Applications'

# Basic installs for bundle to work well
tap "homebrew/bundle"
tap "buo/cask-upgrade"
brew "github-keygen"
brew "gnupg"
brew "gh"

# CLI Tools
brew "terraform"
brew "awscli"
brew "wget"

### CASKS
#Browsers
cask "google-chrome"
cask "firefox"
cask "arc"

# Storage
cask "google-drive"

# Containers
brew "docker"

#Editors
cask "visual-studio-code"
cask "adobe-acrobat-reader"

# Terminals
cask "iterm2"
cask "warp"


# General Device Management
cask "batteries"
cask "onyx"
cask "keka"
cask "appcleaner"
cask "stats"

# Window Management and Snapping
cask "raycast"
cask "alt-tab"
cask "rectangle"

# Screenshot Tool
cask "shottr"

# Menu Bar Management
cask "bartender"

# Office Suite and Productivity
cask "notion"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"

# Messaging
cask "signal"
cask "slack"

# Calendar Management
cask "fantastical"

# Security
cask "expressvpn"
cask "apparency"
cask "suspicious-package"
cask "silentknight"
cask "archaeology"




