# Basic installs for bundle to work well
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
brew "github-keygen"
brew "gnupg"
brew "gh"

### CASKS
#Browsers
cask "google-chrome"
cask "firefox"
cask "arc"

#Code Editors
cask "visual-studio-code"

# Window Management and Snapping
cask "raycast"
cask "alt-tab"
cask "rectangle"

# Screenshot Tool
cask "shottr"

# Menu Bar Management
cask "bartender"

# Office Suite
cask "microsoft-auto-update"
cask "microsoft-office"

# Calendar Management
cask "fantasical"


