# Directory to install application casks
cask_args appdir: '/Applications'

# Basic installs for bundle to work well
# core no longer necessary
# tap "homebrew/core"
tap "homebrew/bundle"
# cask no longer necessary
# tap "homebrew/cask"
tap "buo/cask-upgrade"
brew "github-keygen"
brew "gnupg"
brew "gh"

# CLI Tools
brew "terraform"
brew "awscli"

### CASKS
#Browsers
cask "google-chrome"
cask "firefox"
cask "arc"

#Code Editors
cask "visual-studio-code"

# General Device Management
cask "batteries"

# Window Management and Snapping
cask "raycast"
cask "alt-tab"
cask "rectangle"

# Screenshot Tool
cask "shottr"

# Menu Bar Management
cask "bartender"

# Office Suite
cask "microsoft-auto-update"
cask "microsoft-office"

# Calendar Management
cask "fantastical"

# Security
cask "apparency"
cask "bitwarden"
cask "suspicious-package"
cask "silentknight"
cask "archaeology"




